Revit 2027 API
Document.NewRoom Method
 Creates a new room.
Overload List
Name | Description
NewRoom(Phase) |  Creates a new unplaced room and with an assigned phase.
NewRoom(Level, UV) |  Creates a new room on a level at a specified point.
NewRoom(Room, PlanCircuit) |  Creates a new room within the confines of a plan circuit, or places an unplaced room within the confines of the plan circuit.
Top
See Also
Reference
Document Class
Autodesk.Revit.Creation Namespace